import { LocalizedQuestion } from '../../types';

export const arQuestions: LocalizedQuestion[] = [
  { id: 1, text: 'هل تعرض الشخص المسن للسقوط خلال الـ 12 شهرا الماضية؟' },
  { id: 2, text: 'هل يعاني من اضطرابات في التوازن أو دوخة؟' },
  { id: 3, text: 'هل لديه مشاكل بصرية غير مصححة؟' },
  { id: 4, text: 'هل يتناول أكثر من 3 أدوية يوميا؟' },
  {
    id: 5,
    text: 'هل يتناول أدوية قد تسبب النعاس أو انخفاض ضغط الدم؟',
  },
  { id: 6, text: 'هل توجد سجاد غير مثبت على الأرض في المنزل؟' },
  { id: 7, text: 'هل الإضاءة في المنزل غير كافية ليلا؟' },
  { id: 8, text: 'هل الأرضية مزدحمة (أسلاك كهربائية، أشياء على الأرض)؟' },
  { id: 9, text: 'هل الحمام لا يحتوي على مقابض دعم؟' },
  { id: 10, text: 'هل يرتدي الشخص أحذية غير مناسبة داخل المنزل؟' },
  { id: 11, text: 'هل يعاني من ضعف عضلي في الأطراف السفلية؟' },
  { id: 12, text: 'هل يعيش بمفرده دون مساعدة منتظمة؟' },
];
