import { LocalizedQuestion } from '../../types';

export const arQuestions: LocalizedQuestion[] = [
  { id: 1, text: 'هل تعرض الشخص المسن للسقوط خلال الـ 12 شهرا الماضية؟' },
  { id: 2, text: 'هل يعاني الشخص المسن من اضطرابات في التوازن أو الدوخة؟' },
  { id: 3, text: 'هل لدى الشخص المسن مشاكل بصرية غير مصححة؟' },
  { id: 4, text: 'هل يتناول الشخص المسن أكثر من 3 أدوية في اليوم؟' },
  {
    id: 5,
    text: 'هل يتناول الشخص المسن أدوية قد تسبب النعاس أو انخفاض ضغط الدم؟',
  },
  { id: 6, text: 'هل توجد سجاد غير مثبت على الأرض في المنزل؟' },
  { id: 7, text: 'هل الإضاءة في المنزل غير كافية في الليل؟' },
  { id: 8, text: 'هل الأرضية مزدحمة (أسلاك كهربائية، أشياء على الأرض)؟' },
  { id: 9, text: 'هل الحمام لا يحتوي على قضبان دعم؟' },
  { id: 10, text: 'هل يرتدي الشخص المسن أحذية غير مناسبة في المنزل؟' },
  { id: 11, text: 'هل يعاني الشخص المسن من ضعف عضلي في الأطراف السفلية؟' },
  { id: 12, text: 'هل يعيش الشخص المسن وحده دون مساعدة منتظمة؟' },
];
